export default defineI18nConfig(() => ({
    legacy: false,
    locale: 'kr',
    messages: {
   // Header
   kr: {
    // Home page start
    catalog: "Каталог",
    company_about: " Кампания ҳақида",
    blog: "Блог",
    calculyator: "Калькулятор",
    contact: "Контактлар",

    // Hero
    heroH1: "Ҳар қандай шароитда металларни биз билан осон топасиз",
    heroP:
      "Металларни сиз хоҳлаган миқдорда ва сиз хоҳлаган сифатда етказиб бера оламиз",

    HeroButton: "Маҳсулотларни кўриш",
    HeroButtonContact: "Контакт",

    //  ProductTop
    ProductTopH0: "ТОП маҳсулотлар",
    ProductTopth1: "Темир Маҳсулот Тури",
    ProductTopth2: "Категорияси",
    ProductTopth3: "Узунлиги",
    ProductTopth4: "Қалинлиги",
    ProductTopth5: "Сотув Нархи(1м учун)",

    // Catalog
    CatalogH2: "Каталог",
    SpanDvuxtavr: "Двухтавр",
    SpanShveller: "Швеллер",
    SpanUgalok: "Угалок",
    SpanTruba: "Труба",
    SpanList: "Лист",
    SpanArmatura: "Арматура",
    SpanKvadratprofil: "Квадрат профил",
    SpanKvadratprut: "Квадрат прут",
    SpanPrut: "Прут",
    SpanMetallpalasa: "Металл паласа",
    SpanMetallplanka: "Металл планка",
    SpanKataloggaotish: "Каталогга ўтиш",

    // WeAbout
    PAboutWe:
      "БИГ МEТАЛЛ” кампанияси 2005 йил РУСТАМЖОН ҚАДИРОВ томонидан ташкил топилди. Ўша йилларда эски  кичик кичик трубалар сотиш билан шугулланарди. Хозирги кунга келиб сотувдаги металл махсулотларини барча турлари  мавжуд болиб. Жуда коп мижозлар билан иw олиб боряпти. Бу 19 йиллик тажрибада хамда wу даврда БИГ МEТАЛЛ кампанияси совда сотиқни оwириw ва иwлаб чиқариw харидорга сифатли металл етказиw билан копкина нуфузли кампанияларни иwончли ҳамкорига айланиб улгурди.",
    H2AboutWe: "Биз ҳақимизда",

    //  Pixabay
    PixabayH2:
      "Маҳсулотларни исталган вақтда қулай нархда “ БИГ МEТАЛЛ “ дан топинг",
    PixabayP: "тоннагача бепул етказиб бериш",

    // Partner
    PartnerH6: "Биз ишлаган ташкилотлар",
    PartnerH3: "Бу компаниялар бизга ишонишади",
    PartnerP:
      "Ушбу ташкилотлар билан 10 йилдан ортиқ вақт давомида бирга ўз фаолиятимизни юритиб келмоқдамиз, ҳамкорларимизнинг ишончи фаолиятимизда энг муҳим таянч.",

    // Contact
    ContactH1: "Манзил",
    ContactP:
      "Тошкент шаҳри, Юнусобод тумани, Қурувчилар маҳлласи, Ашхобод кўчаси 42-уй",
    ContactButton: "Харитадан кўриш",
    ContactH: "Боғланиш учун :",
    Contactlabel1: "Исмингиз",
    Contactlabel2: "Телефон рақам",
    Contactlabel3: "Маълумот",
    ContactTextarea: "Менга металл лист маҳсулотлари керак",
    ContactButton2: "Юбориш",

    // Footer
    Footercatalog: "Каталог",
    Footerabout: "Компания ҳақида",
    Footerblog: "Блог",
    Footercalculyator: "Калькулятор",
    Footercontact: "Контактлар",
    FooterH5: "Боғланиш учун :",
    FooterButton: "Харитадан кўриш",
    FooterH6: "Манзил : Юнусобод тумани, Қурувчилар маҳалласи, 42-уй",
    FooterH7: "Барча ҳуқуқлар ҳимояланган. “БИГ МEТАЛЛ” 2023",
    FooterBuuton2: "Харитадан кўриш",
    // Home page end

    // About Company start

    companyH1:
      "Сизни компаниямиз веб-сайтига ташриф буюрганингиздан мамнунмиз!  ",
    companyH3:
      "Биз билан ҳамкорлик қилсангиз, сиз учун нархлар янада қулайлашиб боради. Бизнинг мақсадимиз мижозлар ишончини қозониш ва уларга сифатли маҳсулот етказиб бериш. Маҳсулотлар ва биз ҳақимиздаги маълумотлар қуйида кенгроқ берилган. Биз сиз билан ишлашдан мамнунмиз !",
    companyP:
      "Бизнинг мақсадимиз мижозлар ишончини қозониш ва уларга сифатли маҳсулот етказиб бериш.",
      companyH51: "50.000 т",
      companyH52: "185 т",
      companyH53: "3000 т",
      companyP1: "Йиллик маҳсулот айланмаси",
      companyP2: "Кунлик маҳсулот айланмаси",
      companyP3: "Ҳозирда сотувда мавжуд",

    companyAboutH2: "Биз ҳақимизда",
    companyAboutP1:
      "БИГ МEТАЛЛ” кампанияси 2005 йил РУСТАМЖОН ҚАДИРОВ томонидан ташкил топилди. Ўша йилларда эски  кичик кичик трубалар сотиш билан шугулланарди. Хозирги кунга келиб сотувдаги металл махсулотларини барча турлари  мавжуд болиб. Жуда коп мижозлар билан иw олиб боряпти. Бу 19 йиллик тажрибада хамда wу даврда БИГ МEТАЛЛ кампанияси совда сотиқни оwириw ва иwлаб чиқариw харидорга сифатли металл етказиw билан копкина нуфузли кампанияларни иwончли ҳамкорига айланиб улгурди.",

    TargetH41: "СТРАТEГИЯ",
    TargetH42: "МАҚСАД",
    TargetH43: "МИССИЯ",
    TargetH51: "Бизнинг стратегия",
    TargetH52: "Бизнинг стратегия",
    TargetH53: "Бизнинг стратегия",
    TargetP1:
      "Бизнинг стратегиямиз, мижозлар билан савдо алоқаларини яхшилаш ва уларга сифатли хизмат кўрсатишни босқичма-босқич янгилаш",
    TargetP2:
      "Бизнинг стратегиямиз, мижозлар билан савдо алоқаларини яхшилаш ва уларга сифатли хизмат кўрсатишни босқичма-босқич янгилаш",
    TargetP3:
      "Бизнинг стратегиямиз, мижозлар билан савдо алоқаларини яхшилаш ва уларга сифатли хизмат кўрсатишни босқичма-босқич янгилаш",

    // About Company end

    // Blog start
    BlogButton: "Батафсил",
    // Blog end

    // Contact start
    ContactPageH3: "Контакт",
    ContactPageP:
      "Бизга исталган вақтда хабар қолдиринг. Операторларимиз сиз билан тез орада боғланишади",
    ContactPageInput: "Исмингиз",
    ContactPageInput2: "Телефон рақамингиз",
    ContactPageInput3: "Хабар",
    ContactPageButton: "Юбориш",
    ConatctPageH4: "Инфо",
    ContactPageH6: "Юнусобод тумани, 19-даҳа, 15-уй",

    // Contact end
    //Catalog id 
    catalogoption: 'Ҳамма Маҳсулотлар',
    //Calculyator
    CalcH2: "Калькулятор",
    //Basket 
    BasketH1: 'Корзинка',
    BasketButton: 'Барчасини ўчириш',
    BasketSpan1: 'сўм',
    BasketSpanDiv: 'сўм',
    BasketSpan2: 'Умумий нарх :',
    BasketSpanA: 'Буюртмани расмийлаштириш', 

    //Basket Submit
    BasketInput1: 'Исмингиз',
    BasketInput2: 'Телефон рақамингиз',
    BasketButton2: 'Жўнатиш',
  },
  ru: {
    // Home page start
    // Header
    catalog: "Каталог",
    company_about: "О кампании",
    blog: "Блог",
    calculyator: "Калькулятор",
    contact: "Контакты",

    // Hero
    heroH1: "У нас вы легко найдете металлы в любой ситуации",
    heroP:
      "Мы можем поставить металлы в нужном вам количестве и желаемом качестве.",

    HeroButton: "Посмотреть продукты",
    HeroButtonContact: "Контакт",

    //  ProductTop
    ProductTopH0: "ТОП продукты",
    ProductTopth1: "Тип железного продукта",
    ProductTopth2: "Категория",
    ProductTopth3: "Длина",
    ProductTopth4: "Толщина",
    ProductTopth5: "Цена продажи (за 1м)",

    // Catalog
    CatalogH2: "Каталог",
    SpanDvuxtavr: "Двухтавр",
    SpanShveller: "Швеллер",
    SpanUgalok: "Угалок",
    SpanTruba: "Труба",
    SpanList: "Лист",
    SpanArmatura: "Арматура",
    SpanKvadratprofil: "Квадрат профил",
    SpanKvadratprut: "Квадрат прут",
    SpanPrut: "Прут",
    SpanMetallpalasa: "Металлическая паласа",
    SpanMetallplanka: "Металлическая пластина",
    SpanKataloggaotish: "Перейти в каталог",

    // WeAbout
    PAboutWe:
      "Рекламная кампания «БОЛЬШОЙ МЕТАЛЛ» 2005 г. Ее основателем является РУСТАМЖОН КАДЫРОВ. В те годы он занимался продажей старых небольших трубок. Сегодня в продаже имеются все виды металлопродукции. По количеству клиентов iw лидирует. За этот 19-летний опыт кампания BIG METALL стала надежным партнером многих престижных акций по продвижению продажи и доставки качественного металла покупателю.",
    H2AboutWe: "О нас",

    //  Pixabay
    PixabayH2:
      "Найдите товары в «БИГ МЕТАЛЛ» по доступным ценам в любое время.",
    PixabayP: "бесплатная доставка до тонны",

    // Partner
    PartnerH6: "Организации, с которыми мы работали",
    PartnerH3: "Эти компании доверяют нам",
    PartnerP:
      "Мы сотрудничаем с этими организациями уже более 10 лет, доверие наших партнеров – важнейшая поддержка в нашей работе.",
    // Contact
    ContactH1: "Адрес",
    ContactP:
      "г.Ташкент, Юнусабадский район, микрорайон Строителей, улица Ашхабад 42",
    ContactButton: "Посмотреть с карты",
    ContactH: "Связаться :",
    Contactlabel1: "Ваше имя",
    Contactlabel2: "Номер телефона",
    Contactlabel3: "Информация",
    ContactTextarea: "Мне нужны изделия из листового металла",
    ContactButton2: "Отправка",

    // Footer
    Footercatalog: "Каталог",
    Footerabout: "О компании",
    Footerblog: "Блог",
    Footercalculyator: "Калькулятор",
    Footercontact: "Контакты",
    FooterH5: "Связаться :",
    FooterButton: "Посмотреть с карты",
    FooterH6: "Адрес: Юнусабадский район, квартал Строителей, 42.",
    FooterH7: "Все права защищены. «БИГ МЕТАЛЛ» 2023",
    FooterBuuton2: "Посмотреть с карты",
    // Home page end

    // About Company start
    companyH1: "Мы рады, что Вы посетили сайт нашей компании!",
    companyH3:
      "Если вы будете сотрудничать с нами, цены будут для вас более удобными. Наша цель – завоевать доверие наших клиентов и предоставить им качественную продукцию. Более подробно информация о продукции и о нас представлена ​​ниже. Мы рады работать с вами!",
    companyP:
      "Наша цель – завоевать доверие наших клиентов и предоставить им качественную продукцию.",
      companyH51: "3500 т",
      companyH52: "2500 т",
      companyH53: "5т dan/10 т",
    companyP1: "Тонны продукции перерабатываются в год",
    companyP2: "Оборот продукции",
    companyP3: "Тираж по состоянию на день",

    companyAboutH2: "О нас",
    companyAboutP1:
      "Рекламная кампания «БОЛЬШОЙ МЕТАЛЛ» 2005 г. Ее основателем является РУСТАМЖОН КАДЫРОВ. В те годы он занимался продажей старых небольших трубок. Сегодня в продаже имеются все виды металлопродукции. По количеству клиентов iw лидирует. За этот 19-летний опыт кампания BIG METALL стала надежным партнером многих престижных акций по продвижению продажи и доставки качественного металла покупателю.",

    TargetH41: "СТРАТЕГИЯ",
    TargetH42: "ЦЕЛЬ",
    TargetH43: "МИССИЯ",
    TargetH51: "Наша стратегия",
    TargetH52: "Наша стратегия",
    TargetH53: "Наша стратегия",
    TargetP1:
      "Наша стратегия – улучшение торговых отношений с клиентами и постепенное повышение качества их обслуживания.",
    TargetP2:
      "Наша стратегия – улучшение торговых отношений с клиентами и постепенное повышение качества их обслуживания.",
    TargetP3:
      "Наша стратегия – улучшение торговых отношений с клиентами и постепенное повышение качества их обслуживания.",
    // About Company end

    // Blog start
    BlogButton: "Более",
    // Blog end

    // Contact start
    ContactPageH3: "Контакт",
    ContactPageP:
      "Напишите нам сообщение в любое время. Наши операторы свяжутся с вами в ближайшее время",
    ContactPageInput: "Ваше имя",
    ContactPageInput2: "Ваш номер телефона",
    ContactPageInput3: "Сообщение",
    ContactPageButton: "Отправка",
    ConatctPageH4: "Информация",
    ContactPageH6: "Юнусабадский район, 19-даха, 15 дом",
    // Contact end
    //Catalog id 
    catalogoption: 'Все продукты',
    //Calculyator
    CalcH2: "Калькулятор",


      //Basket
    BasketH1: 'Корзинка',
    BasketButton: 'Удалить все',
    BasketSpan1: 'сум',
    BasketSpanDiv: 'сум',
    BasketSpan2: 'Итоговая цена :',
    BasketSpanA: 'Обработка заказа', 
        //Basket Submit
        BasketInput1: 'Ваше имя',
        BasketInput2: 'Ваш номер телефона',
        BasketButton2: 'Подавать',
  },
    }
  }))
  